/*
 * Copyright (c) 2022-2023, NeKz
 *
 * SPDX-License-Identifier: MIT
 */

#include <algorithm>
#include <intrin.h>

#include "framework.hpp"
#include "xdead.hpp"
#include "xlive.hpp"

#define WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <wincrypt.h>

#pragma warning(disable : 102)

using namespace xlive;

#define EXPORT __declspec(dllexport)

#define DECL_DETOUR_API(type, cc, name, ...)                                                                           \
    using _##name = type(cc*)(##__VA_ARGS__);                                                                          \
    static auto name##_listeners = std::vector<xdead::Listener<_##name>>();                                            \
    EXPORT type cc name(##__VA_ARGS__)

#define DETOUR_API(type, cc, name, ...) EXPORT type cc name(##__VA_ARGS__)

typedef uintptr_t hex;

#define dptr(ptr) ptr ? *(uintptr_t*)ptr : 0

DECL_DETOUR_API(signed int, __stdcall, xlive_3, int a1, signed int a2, signed int a3);
DECL_DETOUR_API(signed int, __stdcall, xlive_4, int a1);
DECL_DETOUR_API(signed int, __stdcall, xlive_6, int a1, int a2, signed int* a3);
DECL_DETOUR_API(signed int, __stdcall, xlive_7, int a1, int a2, signed int a3, int* a4, signed int a5);
DECL_DETOUR_API(int, __stdcall, xlive_8, int a1, int a2, int a3, void* a4, int a5);
DECL_DETOUR_API(int, __stdcall, xlive_9, int a1, int a2, int a3);
DECL_DETOUR_API(int, __stdcall, xlive_11, int a1, int a2, int a3);

    RUN_LISTENERS_AND_RETURN(5002, "XLiveRender");
}
DETOUR_API(int, __stdcall, xlive_5003)
{
    SET_RETURN_VALUE(0);
    RUN_LISTENERS(5003, "XLiveUninitialize");
    LOG_AND_RETURN("");
}
DETOUR_API(signed int, __stdcall, xlive_5006)
{
    SET_RETURN_VALUE(0);
    RUN_LISTENERS(5006, "XLiveOnDestroyDevice");
    LOG_AND_RETURN("");
}
DETOUR_API(signed int, __stdcall, xlive_5007, int a1)
{
    SET_RETURN_VALUE(0);
    RUN_LISTENERS(5007, "XLiveOnResetDevice", a1);
    LOG_AND_RETURN("{:x}", hex(a1));
}
DETOUR_API(signed int, __stdcall, xlive_5008, int a1, int a2, DWORD* a3)
{
    SET_RETURN_VALUE(0);
    RUN_LISTENERS(5008, "XHVCreateEngine", a1, a2, a3);
    LOG_AND_RETURN("{:x}, {:x}, {:x}", hex(a1), hex(a2), hex(a3));
}
DETOUR_API(signed int, __stdcall, xlive_5016, int a1, unsigned int a2)
{
    RUN_LISTENERS(5016, "XLivePBufferAllocate", a1, a2);
    LOG_AND_RETURN("{:x}, {:x}", hex(a1), hex(a2));
}
DETOUR_API(signed int, __stdcall, xlive_5017, int a1)
{
    RUN_LISTENERS(5017, "XLivePBufferFree", a1);
    LOG_AND_RETURN("{:x}", hex(a1));
}
DETOUR_API(int, __stdcall, xlive_5030, HIMC a1)
{
    SET_RETURN_VALUE(0);
    // frequently called when window focused
    RUN_LISTENERS_AND_RETURN(5030, "XLivePreTranslateMessage", a1);
    LOG_AND_RETURN("{:x}", hex(a1));
}
DETOUR_API(int, __stdcall, xlive_5031, unsigned int a1, DWORD* a2)
{
    // Wait, this sounds interesting...
    SET_RETURN_VALUE(0);
    RUN_LISTENERS(5031, "XLiveSetDebugLevel", a1, a2);
    LOG_AND_RETURN("{:x}, {:x}", hex(a1), hex(a2));
}
DETOUR_API(int, __stdcall, xlive_5212, int a1, int a2, int a3, int a4, int a5, int a6, int a7, int a8, void* Src, void* a10, int a11, int a12)
{
    // called frequently on login
    RUN_LISTENERS(5212, "XShowCustomPlayerListUI", a1, a2, a3, a4, a5, a6, a7, a8, Src, a10, a11, a12);
    LOG_AND_RETURN("{:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}", hex(a1), hex(a2), hex(a3), hex(a4), hex(a5), hex(a6), hex(a7), hex(a8), hex(Src), hex(a10), hex(a11), hex(a12));
}
DETOUR_API(signed int, __stdcall, xlive_5215, int a1)
{
    SET_RETURN_VALUE(0);
    RUN_LISTENERS(5215, "XShowGuideUI", a1);
    LOG_AND_RETURN("{:x}", hex(a1));
}
DETOUR_API(signed int, __stdcall, xlive_5216, int a1, int a2, int a3, int a4, int a5, int a6, int a7, int a8)
{
    RUN_LISTENERS(5216, "XShowKeyboardUI", a1, a2, a3, a4, a5, a6, a7, a8);
    LOG_AND_RETURN("{:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}, {:x}", hex(a1), hex(a2), hex(a3), hex(a4), hex(a5), hex(a6), hex(a7), hex(a8));
}
DETOUR_API(int, __stdcall, xlive_5251, HANDLE hObject)
{
    SET_RETURN_VALUE(1);
    // called frequently acquiring a handle
    RUN_LISTENERS(5251, "XCloseHandle", hObject);
    LOG_AND_RETURN("{:x}", hex(hObject));
}
DETOUR_API(signed int, __stdcall, xlive_5252, int a1, __int64 a2)
{
    SET_RETURN_VALUE(0);
    RUN_LISTENERS(5252, "XShowGamerCardUI", a1, a2);
    LOG_AND_RETURN("{:x}, {:x}", hex(a1), __int64(a2));
}
DETOUR_API(int, __stdcall, xlive_5256, int a1, int a2, int a3, DWORD* a4, int a5)
{
    struct XLiveLeaderboardStats {
        char unk_0000[40]; // 0x00
        uint32_t xp; // 0x28
        char unk_002c[20]; // 0x2c
        uint32_t derezz; // 0x40
        char unk_0044[20]; // 0x44
        uint32_t wipes; // 0x58
        char unk_005c[20]; // 0x5c
        uint32_t assists; // 0x70
        char unk_0074[20]; // 0x74
        uint32_t bits_nodes; // 0x88
        char unk_008c[20]; // 0x8c
        uint32_t played; // 0xa0
        char unk_00a4[28]; // 0xa4
    };
    static_assert(offsetof(XLiveLeaderboardStats, xp) == 0x28);
    static_assert(offsetof(XLiveLeaderboardStats, derezz) == 0x40);
    static_assert(offsetof(XLiveLeaderboardStats, wipes) == 0x58);
    static_assert(offsetof(XLiveLeaderboardStats, assists) == 0x70);
    static_assert(offsetof(XLiveLeaderboardStats, bits_nodes) == 0x88);
    static_assert(offsetof(XLiveLeaderboardStats, played) == 0xa0);
    static_assert(sizeof(XLiveLeaderboardStats) == 0xc0);

    struct XLiveLeaderboardEntry {
        ULONGLONG xuid; // 0x00
        uint32_t rank; // 0x0x8
        char unk_000c[12]; // 0x0c
        char gamer_tag[16]; // 0x18
        uint32_t columns; // 0x28
        XLiveLeaderboardStats* stats; // 0x2c
    };
    static_assert(offsetof(XLiveLeaderboardEntry, xuid) == 0x00);
    static_assert(offsetof(XLiveLeaderboardEntry, rank) == 0x08);
    static_assert(offsetof(XLiveLeaderboardEntry, gamer_tag) == 0x18);
    static_assert(offsetof(XLiveLeaderboardEntry, columns) == 0x28);
    static_assert(offsetof(XLiveLeaderboardEntry, stats) == 0x2c);
    static_assert(sizeof(XLiveLeaderboardEntry) == 0x30);

    struct XLiveLeaderboard {
        uint32_t unk_0000; // 0x00
        uint32_t unk_0004; // 0x04
        uint32_t unk_0008; // 0x08
        uint32_t unk_000c; // 0x0c
        uint32_t count; // 0x10
        XLiveLeaderboardEntry* first_entry; // 0x14
        XLiveLeaderboardEntry entries[22]; // 0x18
    };
    static_assert(offsetof(XLiveLeaderboard, count) == 0x10);
    static_assert(offsetof(XLiveLeaderboard, first_entry) == 0x14);
    static_assert(offsetof(XLiveLeaderboard, entries) == 0x18);

    SET_RETURN_VALUE(0);
    // called after login
    RUN_LISTENERS(5256, "XEnumerate", a1, a2, a3, a4, a5);
    LOG_AND_RETURN("{:x}, {:x}, {:x}, {:x}, {:x}", hex(a1), hex(a2), hex(a3), hex(a4), hex(a5));
}
DETOUR_API(signed int, __stdcall, xlive_5258, int a1)
{
    RUN_LISTENERS(5258, "XLiveSignout", a1);
    LOG_AND_RETURN("{:x}", hex(a1));
}
DETOUR_API(XUSER_SIGNIN_STATE, __stdcall, xlive_5262, int a1)
{
    SET_RETURN_VALUE(XUSER_SIGNIN_STATE::NotSignedIn);
    RUN_LISTENERS(5262, "XUserGetSigninState", a1);
    LOG_AND_RETURN("{:x}", hex(a1));
}
DETOUR_API(int, __stdcall, xlive_5263, uint32_t user_index, CHAR* user_name, uint32_t user_name_length)
{
    SET_RETURN_VALUE(0);
    // called after login
